wisteria-1c/Конфигурация/DataProcessors/РаботаСНоменклатурой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РаботаСНоменклатурой</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СостоянияВыгрузкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВыгрузкиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПакетаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВыгрузкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасшифровкаПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВНациональныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураРаботаСНоменклатурой</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаРаботаСНоменклатурой</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СостоянияВыгрузкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияВыгрузкиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетИсправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СодержитПроблемы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверяетсяМодератором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаЗапрещена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/DataProcessors/РаботаСНоменклатурой/Forms/РезультатыВыгрузкиНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Параметры.Свойство("Организация", Организация);
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	СостоянияВыгрузкиНоменклатуры.Организация КАК Организация
			|ИЗ
			|	РегистрСведений.СостоянияВыгрузкиНоменклатуры КАК СостоянияВыгрузкиНоменклатуры";
		
		ВыборкаДанных = Запрос.Выполнить().Выбрать();
		Если ВыборкаДанных.Следующий() Тогда 
			Организация = ВыборкаДанных.Организация;
		Иначе 
			ТекстСообщения = НСтр("ru = 'Результаты выгрузки не найдены. Форма не может быть открыта.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИмяКоманды = "";
	Параметры.Свойство("ИмяКоманды", ИмяКоманды);
	
	Обработки.РаботаСНоменклатурой.СоздатьЭлементыОтбораПоСостоянию(ЭтотОбъект, 
		Элементы.ГруппаСостоянияВыгрузки.Имя, Элементы.ОтборПоСостоянию, ИмяКоманды, ВидФлажка.Выключатель);
	ОбработатьОтборПоСостоянию(ИмяКоманды);
	
	СтатистикаРезультатов = Неопределено;
	Параметры.Свойство("СтатистикаРезультатов", СтатистикаРезультатов);
	
	ВедетсяУчетПоХарактеристикам = (РаботаСНоменклатурой.ВедетсяУчетПоХарактеристикам() = Истина);
	ПустаяХарактеристика         = ?(ВедетсяУчетПоХарактеристикам, РаботаСНоменклатурой.ПустаяСсылкаНаХарактеристику(), 
										Неопределено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВедетсяУчетПоХарактеристикам", 
		ВедетсяУчетПоХарактеристикам);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ПустаяХарактеристика", 
		ПустаяХарактеристика);
	
	СообщениеБезОшибки = НСтр("ru = 'Идентификатор фида Национального каталога:'");
	ТекстЗапроса       = СтрЗаменить(Список.ТекстЗапроса, "КАК СТРОКА(42)", 
		"КАК СТРОКА(" + Формат(СтрДлина(СообщениеБезОшибки), "ЧН=; ЧГ=0") + ")");
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.Вставить("ТекстЗапроса", ТекстЗапроса);
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СообщениеБезОшибки", СообщениеБезОшибки);
	
	Параметры.Свойство("ПодписыватьЭлектроннойПодписью", ПодписыватьЭлектроннойПодписью);
	НастройкиВыгрузки = РаботаСНоменклатуройСлужебный.НастройкаВыгрузкиНоменклатуры(Организация);
	НастройкиВыгрузки.Свойство("СогласиеНаПубликациюТоваров", СогласиеНаПубликациюТоваров);
	
	ПроверитьЗапуститьОбновлениеДанных(Организация, УникальныйИдентификатор, ПодсчетСтатистикиРезультатов);
	
	Если ПодсчетСтатистикиРезультатов = Неопределено Тогда
		ПодсчетСтатистикиРезультатов = РаботаСНоменклатуройСлужебный.ПолучитьСтатистикуРезультатов(
			УникальныйИдентификатор, 
			Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтоОбновление = Ложь;
	ПроверитьОбработатьЗавершениеДлительнойОперации(ЭтоОбновление);
	
	Если Не ЭтоОбновление Тогда
		РаботаСНоменклатуройСлужебныйКлиент.ОбновитьСтатистикуРезультатов(ЭтотОбъект);
	КонецЕсли;
	
	ПодписыватьЭлектроннойПодписьюНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ВРег(ИмяСобытия) = ВРег("Запись_НаборКонстант")
			И ВРег(Источник) = ВРег("ИспользоватьСервисРаботаСНоменклатурой") Тогда
		Если Не РаботаСНоменклатуройСлужебныйВызовСервера.ИспользоватьСервисРаботаСНоменклатурой() Тогда
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли ВРег(ИмяСобытия) = ВРег("Запись_НаборКонстант")
				И ВРег(Источник) = ВРег("ИспользоватьЭлектронныеПодписи") Тогда
		Если Не ЭлектроннаяПодписьКлиент.ИспользоватьЭлектронныеПодписи() Тогда
			ПодписыватьЭлектроннойПодписью = Ложь;
			ПодписыватьЭлектроннойПодписьюНаКлиенте();
		КонецЕсли;
		
		РаботаСНоменклатуройСлужебныйКлиент.ОбновитьЗаголовкиКнопокСостояние(ЭтотОбъект);
		ОбработатьОтборПоСостоянию();
		
	ИначеЕсли ВРег(ИмяСобытия) = ВРег("Обработка.РаботаСНоменклатурой.ОбновитьСтатистикуРезультатов")
				И Источник = Организация
				И Параметр <> Неопределено Тогда
		СтатистикаРезультатов = Параметр;
		
		РаботаСНоменклатуройСлужебныйКлиент.ОбновитьЗаголовкиКнопокСостояние(ЭтотОбъект);
		ОбработатьОтборПоСостоянию();
		
	ИначеЕсли ВРег(ИмяСобытия) = ВРег("Запись_СостоянияВыгрузкиНоменклатуры")
				И Источник = Организация Тогда
		Если СтатистикаРезультатов.Свойство(Параметр.ПредыдущееСостояние) Тогда
			СтатистикаРезультатов[Параметр.ПредыдущееСостояние] = СтатистикаРезультатов[Параметр.ПредыдущееСостояние] - 1;
		КонецЕсли;
		Если СтатистикаРезультатов.Свойство(Параметр.Состояние) Тогда
			СтатистикаРезультатов[Параметр.Состояние] = СтатистикаРезультатов[Параметр.Состояние] + 1;
		КонецЕсли;
		
		РаботаСНоменклатуройСлужебныйКлиент.ОбновитьЗаголовкиКнопокСостояние(ЭтотОбъект);
		ОбработатьОтборПоСостоянию();
		
	ИначеЕсли ВРег(ИмяСобытия) = ВРег("Обработка.РаботаСНоменклатурой.ПриИзмененииОрганизации")
				И Источник = Организация Тогда
		ПодписыватьЭлектроннойПодписью = Параметр;
		ПодписыватьЭлектроннойПодписьюНаКлиенте();
		
		РаботаСНоменклатуройСлужебныйКлиент.ОбновитьЗаголовкиКнопокСостояние(ЭтотОбъект);
		ОбработатьОтборПоСостоянию();
		
	ИначеЕсли ВРег(ИмяСобытия) = ВРег("Обработка.РаботаСНоменклатурой.ПодписыватьЭлектроннойПодписью")
				И Источник = Организация Тогда
		ПодписыватьЭлектроннойПодписью = Параметр;
		ПодписыватьЭлектроннойПодписьюНаКлиенте();
		
		РаботаСНоменклатуройСлужебныйКлиент.ОбновитьЗаголовкиКнопокСостояние(ЭтотОбъект);
		ОбработатьОтборПоСостоянию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПоСостояниюПриИзменении(Элемент)
	
	ОбработатьОтборПоСостоянию(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаПубликациюТоваровВНациональномКаталогеПриИзменении(Элемент)
	
	ОбновляемыеПараметры = Новый Структура("СогласиеНаПубликациюТоваров", СогласиеНаПубликациюТоваров);
	РаботаСНоменклатуройСлужебныйВызовСервера.ОбновитьПараметрыНастройкиВыгрузки(Организация, ОбновляемыеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.СписокОписаниеОшибки 
			И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ОписаниеОшибки) Тогда
		Оповещение = Новый ОписаниеОповещения("ОповещениеВводСтроки", ЭтотОбъект);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ОписаниеОшибки, НСтр("ru = 'Описание ошибки'"),, Истина);
		
	Иначе 
		ТекущиеДанные = Элемент.ТекущиеДанные;
		НезаполненныеРеквизиты = Новый Массив;
		Если ЗначениеЗаполнено(ТекущиеДанные.РасшифровкаПроблемы) Тогда
			Расшифровка = РаботаСНоменклатуройСлужебныйКлиент.ЗначениеИзСтрокиJSON(ТекущиеДанные.РасшифровкаПроблемы);
			Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
				Расшифровка.Свойство("Проблемы", НезаполненныеРеквизиты);
			КонецЕсли;
		КонецЕсли;
		
		РаботаСНоменклатуройКлиентПереопределяемый.ПоказатьНезаполненныеДанныеНоменклатуры(ТекущиеДанные.Номенклатура, 
			НезаполненныеРеквизиты, ЭтотОбъект, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Параметры:
//   Команда - КомандаФормы - подключаемая команда формы.
//
&НаКлиенте
Процедура Подключаемый_ДействиеКомандыСостояние(Команда)
	
	ОбработатьОтборПоСостоянию(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРезультаты(Команда)
	
	ОбновитьСостоянияВыгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКВыгрузке(Команда)
	
	СтрокиДляОбработки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны данные для повторной выгрузки.'"));
		Возврат;
	КонецЕсли;
	
	СостояниеОтклонено = ПредопределенноеЗначение("Перечисление.СостоянияВыгрузкиНоменклатуры.Отклонена");
	СтрокиКОбмену      = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из СтрокиДляОбработки Цикл
		Если Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Свойство("Состояние") 
				И Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Состояние = СостояниеОтклонено Тогда
			СтрокиКОбмену.Добавить(ВыделеннаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиКОбмену.Количество() > 0 Тогда
		ДлительнаяОперация = РаботаСНоменклатуройСлужебныйВызовСервера.ИзменитьЗаписиРегистраПоСписку(
			УникальныйИдентификатор,
			Организация, 
			СтрокиКОбмену, 
			ПредопределенноеЗначение("Перечисление.СостоянияВыгрузкиНоменклатуры.ОжидаетВыгрузки"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КоличествоИзменение", СтрокиКОбмену.Количество());
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПометитьКВыгрузкеЗавершение", 
			ЭтотОбъект, 
			ДополнительныеПараметры);
		
		Если ДлительнаяОперация.Статус = "Выполнено" Тогда
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ДлительнаяОперация);
			Возврат;
		КонецЕсли;
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе 
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выгрузить повторно можно только товарные позиции в состоянии ""Отклонена"".'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	
	Если Не ПодписыватьЭлектроннойПодписью Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДляОбработки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны карточки товаров для подписания.'"));
		Возврат;
	КонецЕсли;
	
	ЛимитЗапросов = РаботаСНоменклатуройСлужебныйКлиентСервер.ПолучитьЛимитЗапросовНациональногоКаталога();
	Если СтрокиДляОбработки.Количество() > ЛимитЗапросов Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Максимальное количество подписываемых карточек товаров за один вызов'") + " - " + ЛимитЗапросов + ".");
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияТоваровНациональногоКаталогаКПодписанию",
		ЭтотОбъект);
	
	РаботаСНоменклатуройКлиент.ПолучитьТоварыНациональногоКаталогаКПодписанию(
		ЭтотОбъект, 
		Организация,
		СтрокиДляОбработки,
		ИдентификаторЗадания, 
		Неопределено,
		ОповещениеОЗавершении,
		Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокСостояние.Имя);
	
	ГруппаЭлементовОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодписыватьЭлектроннойПодписью");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Истина;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.Состояние");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.СостоянияВыгрузкиНоменклатуры.Принята;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Опубликована'"));
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтборПоСостоянию(ИмяКоманды = "")
	
	ОтборСостоянияВыгрузки = Новый СписокЗначений;
	
	Если Элементы.ОтборПоСостоянию.Видимость Тогда
		Для Каждого Состояние Из СписокСостояний Цикл
			Состояние.Пометка = (ОтборПоСостоянию.НайтиПоЗначению(Состояние.Значение) <> Неопределено);
		КонецЦикла;
		
		ЭлементПринята = ОтборПоСостоянию.НайтиПоЗначению(Перечисления.СостоянияВыгрузкиНоменклатуры.Принята);
		Если ЭлементПринята <> Неопределено Тогда
			Если ПодписыватьЭлектроннойПодписью Тогда
				ЭлементПринята.Представление = НСтр("ru = 'Опубликована'");
			Иначе
				ЭлементПринята.Представление = НСтр("ru = 'Принята'");
			КонецЕсли;
		КонецЕсли;
		
		Если ОтборПоСостоянию.Количество() = 0 Тогда
			Элементы.ОтборПоСостоянию.ПодсказкаВвода = НСтр("ru = 'Все результаты'");
		Иначе
			Элементы.ОтборПоСостоянию.ПодсказкаВвода = "";
		КонецЕсли;
		
	ИначеЕсли Не ИмяКоманды = "" Тогда 
		ЭлементФормы = Элементы[ИмяКоманды];
		
		Если ТипЗнч(ЭлементФормы) = Тип("КнопкаФормы") Тогда
			Пометка              = Не ЭлементФормы.Пометка;
			ЭлементФормы.Пометка = Пометка И ЭлементФормы.Видимость;
			
			Для Каждого Состояние Из СписокСостояний Цикл
				Если Состояние.Представление = ИмяКоманды Тогда
					Состояние.Пометка = Пометка;
				КонецЕсли;
				Если Не Элементы[Состояние.Представление].Видимость Тогда
					Состояние.Пометка = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Состояние Из СписокСостояний Цикл
		Если Состояние.Пометка Тогда
			ОтборСостоянияВыгрузки.Добавить(Состояние.Значение);
			Если Состояние.Значение = Перечисления.СостоянияВыгрузкиНоменклатуры.Принята
					И Не ПодписыватьЭлектроннойПодписью Тогда
				ОтборСостоянияВыгрузки.Добавить(Перечисления.СостоянияВыгрузкиНоменклатуры.ОжидаетПодписания);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборСостоянияВыгрузки.Количество() = 0 Тогда
		ОтборСостоянияВыгрузки = СписокСостояний;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокСостояний", ОтборСостоянияВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписыватьЭлектроннойПодписьюНаКлиенте()
	
	Элементы.СписокПодписать.Видимость = ПодписыватьЭлектроннойПодписью;
	Элементы.ГруппаПодписыватьЭлектроннойПодписью.Видимость = ПодписыватьЭлектроннойПодписью;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ПодписыватьЭлектроннойПодписью", 
		ПодписыватьЭлектроннойПодписью);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВводСтроки(ВведенныйТекст, ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьЗапуститьОбновлениеДанных(Знач Организация, Знач УникальныйИдентификатор, ДлительнаяОперация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.СостоянияВыгрузкиНоменклатуры КАК СостоянияВыгрузкиНоменклатуры
		|ГДЕ
		|	СостоянияВыгрузкиНоменклатуры.Организация = &Организация
		|	И СостоянияВыгрузкиНоменклатуры.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыгрузкиНоменклатуры.ПроверяетсяМодератором)";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ОбновитьСостоянияВыгрузкиНаСервере(Организация, УникальныйИдентификатор);
	ДлительнаяОперация.Вставить("ЭтоОбновление", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостоянияВыгрузки()
	
	ПодсчетСтатистикиРезультатов = ОбновитьСостоянияВыгрузкиНаСервере(Организация, УникальныйИдентификатор);
	ПодсчетСтатистикиРезультатов.Вставить("ЭтоОбновление", Истина);
	
	ПроверитьОбработатьЗавершениеДлительнойОперации();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСостоянияВыгрузкиНаСервере(Знач Организация, Знач УникальныйИдентификатор)
	
	НаименованиеЗадания = НСтр("ru = '1С:Номенклатура. Обновление результатов выгрузки.'");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"РаботаСНоменклатуройСлужебный.ОбновленнаяСтатистикаРезультатов", 
		Организация);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьОбработатьЗавершениеДлительнойОперации(ЭтоОбновление = Ложь)
	
	ОчиститьСообщения();
	
	Если ТипЗнч(ПодсчетСтатистикиРезультатов) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПодсчетСтатистикиРезультатов.Свойство("ЭтоОбновление") Тогда
		ЭтоОбновление = Истина;
	Иначе 
		Возврат;
	КонецЕсли;
	
	Если ПодсчетСтатистикиРезультатов.Свойство("Статус") 
			И ПодсчетСтатистикиРезультатов.Статус = "Выполнено" Тогда
		ОбновлениеСтатистикиЗавершение(ПодсчетСтатистикиРезультатов, Неопределено);
		
	Иначе
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеСтатистикиЗавершение", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания       = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Ложь;
		ПараметрыОжидания.ВыводитьСообщения          = Ложь;
		ПараметрыОжидания.ТекстСообщения             = НСтр("ru = 'Выполняется обновление результатов выгрузки…'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ПодсчетСтатистикиРезультатов, 
			ОповещениеОЗавершении, 
			ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСтатистикиЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	РаботаСНоменклатуройСлужебныйКлиент.ОбновлениеСтатистикиЗавершение(Результат, ЭтотОбъект);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКВыгрузкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" 
			И ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		КоличествоИзменение = ДополнительныеПараметры.КоличествоИзменение;
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отмечено к выгрузке %1 элементов'"), КоличествоИзменение));
		
		СтатистикаРезультатов["Отклонена"]       = СтатистикаРезультатов["Отклонена"] - КоличествоИзменение;
		СтатистикаРезультатов["ОжидаетВыгрузки"] = СтатистикаРезультатов["ОжидаетВыгрузки"] + КоличествоИзменение;
		
		Оповестить("Обработка.РаботаСНоменклатурой.ОбновитьСтатистикуРезультатов", СтатистикаРезультатов, Организация);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияТоваровНациональногоКаталогаКПодписанию(Результат, ДополнительныеПараметры) Экспорт 
	
	ОчиститьСообщения();
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" 
			И ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено"
			И Результат.Свойство("АдресРезультата")
			И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		НаборДанных = ПолучитьДанныеДляПодписанияНаСервере(Результат.АдресРезультата);
		Оповестить("Обработка.РаботаСНоменклатурой.ОбновитьСтатистикуРезультатов", СтатистикаРезультатов, Организация);
		
		Если НаборДанных = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Товарные позиции, доступные к подписанию, отсутствуют или их состояние было изменено в личном кабинете Национального каталога.'"));
			Возврат;
		КонецЕсли;
		
		Данные = Новый Структура;
		Данные.Вставить("Организация");
		Данные.Вставить("Номенклатура");
		Данные.Вставить("ХарактеристикаНоменклатуры");
		Данные.Вставить("ИдентификаторТовара");
		Данные.Вставить("Данные");
		
		Для Каждого ЭлементКоллекции Из НаборДанных Цикл
			ЗаполнитьЗначенияСвойств(Данные, ЭлементКоллекции);
			ОповещениеПриОткрытии = Новый ОписаниеОповещения("ПриОткрытииДанныхПодписания", 
				ЭтотОбъект, 
				ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Данные));
			
			ЭлементКоллекции.Представление.Значение = ОповещениеПриОткрытии;
		КонецЦикла;
		
		ОписаниеДанных = Новый Структура;
		ОписаниеДанных.Вставить("Операция",            НСтр("ru = 'Подписание карточек товаров Национального каталога'"));
		ОписаниеДанных.Вставить("ЗаголовокДанных",     НСтр("ru = 'Данные'"));
		ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
		ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
		ОписаниеДанных.Вставить("ОтборСертификатов",   Новый Структура("Организация", Организация));
		ОписаниеДанных.Вставить("БезПодтверждения",    Ложь);
		ОписаниеДанных.Вставить("ВыполнятьНаСервере",  Неопределено);
		ОписаниеДанных.Вставить("НаборДанных",         НаборДанных);
		ОписаниеДанных.Вставить("ПредставлениеНабора", НСтр("ru = 'Товарные позиции к подписанию (%1)'"));
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтправитьДанныеПослеПодписания", ЭтотОбъект);
		
		ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных,
			ЭтотОбъект,
			ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляПодписанияНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтатистикаРезультатов = Результат.СтатистикаРезультатов;
	
	Если Результат.ТоварыКПодписанию.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборДанных = Новый Массив;
	
	Для Каждого СтрокаТаблицыЗначений Из Результат.ТоварыКПодписанию Цикл
		Данные = ПолучитьДвоичныеДанныеИзСтроки(СтрокаТаблицыЗначений.КарточкаТовара);
		
		ПредставлениеДанных = Новый Структура;
		ПредставлениеДанных.Вставить("Значение",      СтрокаТаблицыЗначений.Номенклатура);
		ПредставлениеДанных.Вставить("Представление", СокрЛП(СтрокаТаблицыЗначений.Номенклатура)
			+ ?(ЗначениеЗаполнено(СтрокаТаблицыЗначений.ХарактеристикаНоменклатуры), 
					", " + СокрЛП(СтрокаТаблицыЗначений.ХарактеристикаНоменклатуры), "")
			+ " (gtin: " + СтрокаТаблицыЗначений.Штрихкод + ")");
			
		ДанныеДляПодписания = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
		ДанныеДляПодписания.Вставить("Данные",        Данные);
		ДанныеДляПодписания.Вставить("Представление", ПредставлениеДанных);
		
		НаборДанных.Добавить(ДанныеДляПодписания);
	КонецЦикла;
	
	Возврат НаборДанных;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытииДанныхПодписания(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		РаботаСНоменклатуройКлиентПереопределяемый.ОткрытьФормуПоДаннымДляПодписания(
			ДополнительныеПараметры,
			ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДанныеПослеПодписания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех Тогда
		ДанныеДляПодписания = Новый Массив;
		
		Для Каждого ТекущийЭлементНабораДанных Из Результат.НаборДанных Цикл
			СвойстваПодписи = ТекущийЭлементНабораДанных.СвойстваПодписи;
			Если ЭтоАдресВременногоХранилища(СвойстваПодписи) Тогда
				СвойстваПодписи = ПолучитьИзВременногоХранилища(СвойстваПодписи);
			КонецЕсли;
			
			Данные = Новый Структура;
			Данные.Вставить("Организация");
			Данные.Вставить("Номенклатура");
			Данные.Вставить("ХарактеристикаНоменклатуры");
			Данные.Вставить("ИдентификаторПакетаДанных");
			Данные.Вставить("Состояние");
			Данные.Вставить("ОписаниеОшибки");
			Данные.Вставить("Хеш");
			Данные.Вставить("ИдентификаторТовара");
			
			ЗаполнитьЗначенияСвойств(Данные, ТекущийЭлементНабораДанных);
			
			Данные.Вставить("КарточкаТовара", Base64Строка(ТекущийЭлементНабораДанных.Данные));
			Данные.Вставить("Подпись",        Base64Строка(СвойстваПодписи.Подпись));
			
			ДанныеДляПодписания.Добавить(Данные);
		КонецЦикла;
		
		Если ДанныеДляПодписания.Количество() > 0 Тогда
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПодписанияТоваровНациональногоКаталога",
				ЭтотОбъект);
			
			РаботаСНоменклатуройКлиент.ПодписатьТоварыНациональногоКаталога(
				ЭтотОбъект, 
				Организация,
				ДанныеДляПодписания,
				ИдентификаторЗадания, 
				Неопределено,
				ОповещениеОЗавершении,
				Истина);
		КонецЕсли;
		
	ИначеЕсли Не Результат.Отказ Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось подписать данные товаров Национального каталога.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодписанияТоваровНациональногоКаталога(Результат, ДополнительныеПараметры) Экспорт 
	
	ОчиститьСообщения();
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" 
			И ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено"
			И Результат.Свойство("АдресРезультата")
			И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		РезультатПодписания = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если РезультатПодписания.Успешно = Истина Тогда
			ПоказатьОповещениеПользователя(,, НСтр("ru = 'Подписание товаров Национального каталога завершено.'"), 
				БиблиотекаКартинок.Успешно32, 
				СтатусОповещенияПользователя.Информация);
		Иначе
			ПоказатьОповещениеПользователя(,, НСтр("ru = 'Подписание товаров Национального каталога завершено с ошибками.'"), 
				БиблиотекаКартинок.Предупреждение32, 
				СтатусОповещенияПользователя.Информация);
		КонецЕсли;
		
		Оповестить("Обработка.РаботаСНоменклатурой.ОбновитьСтатистикуРезультатов", 
			РезультатПодписания.СтатистикаРезультатов, Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
